/*----------------------------------------------------------------------------
 * 卡片检测实例 （仅对 PCSC 读卡器有效）
 * ---------------------------------------
 *
 * 卡片、读卡器插拔事件的获取
 *
 * by 渝武陶 (y.volta@mail.com)
 * rev 1.0.0, $$ 2011-12-02 08:32:05 $$
 *---------------------------------------------------------------------------*/

rd_trace ( 1 );             // 开启检测功能

////////////////////////////////////////////////////////////////////////////////
//                               卡片个人化实例 
////////////////////////////////////////////////////////////////////////////////
#if 0 
bool is_card_inserted ()
{
    u32 t_rd_status = _rd_status;
    if (t_rd_status & 0x80000000)
    {
        if (t_rd_status & 0x00000001)
            return true;
    }
    
    return 0;
}

void DoPeronalize ()
{
    do 
    {
        sleep ( 100 );
    } while (!is_card_inserted ());
    rd_reconn ( );
    
    for ( int i=0; i<10; i++ ) 
    {
        $ 0084 0400 00;
    }
    
    printf ( "个人化完成，请插入新卡。\n" );
    do 
    {
        sleep ( 100 );
    } while (is_card_inserted ());
}

while (0) {
    
    DoPeronalize ();    
    
}
#endif // 卡片个人化实例 

////////////////////////////////////////////////////////////////////////////////
//                         单纯 PC/SC 读卡器、卡片检测
////////////////////////////////////////////////////////////////////////////////
#if 1 
//
// 执行代码前，请在“读卡器”工具栏中，选择一个 PC/SC 读卡器，并点击“打开”。
// 此时不接入卡片会报“打开”失败，不必理会。
// 如下示例代码为死循环，要退出执行，请按 Shift+F5
//
while (true)
{
    u32 t_rd_status = _rd_status;
    
    if (t_rd_status & 0x80000000)
    {
        if (t_rd_status & 0x00010000)
            printf ( "Reader Connected.\n" );
        else if ((t_rd_status & 0x00010000) == 0)
            printf ( "Reader Dis-onnected.\n" );
            
        if (t_rd_status & 0x00000001)
            printf ( "Card Inserted.\n" );
        else if ((t_rd_status & 0x00000001) == 0)
            printf ( "Card Removed.\n" );            

        _rd_status = 0;
    }
    
    sleep ( 100 );
}
#endif // 单纯 PC/SC 读卡器、卡片检测

rd_trace (0);               // 关闭检测功能

/* --------------------------------------------- end-of-script ---------------*/
